CONGRATS_MESSAGE = "Отлично! Этот ответ верный!"
FAIL_MESSAGE = "Увы, но правильный ответ:\n{}"
START_MESSAGE = 'Добро пожаловать! Какие тесты мы пройдём сегодня?'
START_TESTING_MESSAGE = 'Ну что, начнём тесты! Выберите подходящий тест.'
START_STATS_MESSAGE = "Что хотите узнать?"
SELECT_DIFF_LEVEL_MESSAGE = 'Введите уровень сложности. Число от 1 до 5.'
TEST_FINISHED = "На этом пока всё!\nВы ответили правильно на {} из {} вопросов."
ENDLESS_FINISHED = "На этом пока всё!\nТекущий результат {} вопросов."
TEST_AFTERSTATE = "Что будем делать теперь?"
TEST_QUIT = "Завершить преждевременно"
DIFF_LEVEL_ERROR = 'Уровень сложности некорректен!'
PLEASE_TRY_AGAIN = 'Пожалуйста, попробуйте ещё раз.'
HELP_MESSAGE = ("Здравствуйте! Этот бот предназначен для прохождения тестов по русскмому языку, однако стремится "
                "сделать этот процесс как можно увлекательнее. Поэтому он ведёт статистику всех участников, "
                "позволяя соревноваться с ними, а также предлагает несколько режимов тестирований.")
QUESTION_NUM = "Вопрос №{}"
QUESTION_TASK = "Какое слово из предложенных нужно подставить вместо *****?\n"
RESULTS = ("Ваши результаты\nКоличество правильных ответов: {}\nДоля правильных ответов: {}\nСамая длинная серия "
           "вопросов в бесконечном режиме: {}")
RESULTS_ELSE = ("{} результаты\nКоличество правильных ответов: {}\nДоля правильных ответов: {}\nСамая длинная серия "
                "вопросов в бесконечном режиме: {}")
FIND_BY_USERNAME = "Введите username, который хотите посмотреть"
LB_HEADER_TASKS = "Давшие больше всего правильных ответов:"
LB_HEADER_ENDLESS = "Прошедшие дальше всех в бесконечном режиме:"
LEADERBOARDS = "{place}. {leader} - {score}"
ERROR = "Упс! Что-то пошло не так, может попробуем ещё раз?"
ENDLESS_TEST_RULES = ""
